# DATABASE & TABLE CREATION

In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
pip install cryptography

Requirement already satisfied: cryptography in /Users/haddock_ana/anaconda3/envs/Ironhack/lib/python3.11/site-packages (42.0.5)
Requirement already satisfied: cffi>=1.12 in /Users/haddock_ana/anaconda3/envs/Ironhack/lib/python3.11/site-packages (from cryptography) (1.16.0)
Requirement already satisfied: pycparser in /Users/haddock_ana/anaconda3/envs/Ironhack/lib/python3.11/site-packages (from cffi>=1.12->cryptography) (2.21)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import pymysql
import sqlalchemy as alch
from getpass import getpass

In [4]:
password = getpass('Introduce tu contrase√±a')

In [5]:
# Connect to MySQL
conn = pymysql.connect(
    host='localhost', # select user() en my sql para ver el host
    user='root',
    password=password,
    database='bank' # esto es para tener algo en comun, una vez dentro se pueden crear otras db
)
# Create a cursor object
cursor = conn.cursor() # esto permite interaccionar entre las dos vias, ejecuta directamente como si estuvieras en sql
# Create database
cursor.execute("CREATE DATABASE IF NOT EXISTS Agile_Solutions")
# Select the database
cursor.execute("USE Agile_Solutions")

0

## Create tables structure

In [6]:
# Create tables

membership_table =  """
CREATE TABLE IF NOT EXISTS membership (
    m_id int (11) unique not null,
    start_date date,
    end_date date,
    constraint primary key (m_id)
)
"""

customer_table = """
CREATE TABLE IF NOT EXISTS customer (
    cus_id int (11) unique not null,
    name varchar(30) DEFAULT NULL,
    email varchar(50) not null,
    contact varchar(12) DEFAULT NULL,
    address varchar(100) not null,
    cus_type varchar(30) DEFAULT NULL,
    membership_id int (11) DEFAULT NULL,

    constraint primary key (cus_id),
    constraint foreign key (membership_id) references membership (m_id)
)
"""

shipment_details_table = """
CREATE TABLE IF NOT EXISTS shipments_details (
    sd_id int(11),
    sd_content varchar(40) DEFAULT NULL,
    sd_domain varchar(15) DEFAULT NULL,
    sd_type varchar(15) DEFAULT NULL,
    sd_weight varchar(10) DEFAULT NULL,
    sd_charges int (10) DEFAULT NULL,
    sd_address varchar(100) DEFAULT NULL,
    ds_address varchar (100) DEFAULT NULL,
    customer_id int (11),
    
    constraint primary key (sd_id),
    constraint foreign key (customer_id) references customer (cus_id)
)
"""

status_table = """
CREATE TABLE IF NOT EXISTS status (
    current_st varchar (15) DEFAULT NULL,
    sent_date date DEFAULT NULL,
    delivery_date date DEFAULT NULL,
    sh_status_id int (11),
    
    constraint primary key (sh_status_id),
    constraint foreign key (sh_status_id) references shipments_details (sd_id)
)
"""

payment_table = """
CREATE TABLE IF NOT EXISTS payment (
    payment_id varchar (40) not null,
    amount int (11) DEFAULT NULL,
    payment_status varchar(10) DEFAULT NULL,
    payment_date date DEFAULT NULL,
    payment_mode varchar (25) DEFAULT NULL,
    sh_id int (11),
    sh_client_id int (11),
    
    constraint primary key (payment_id),
    constraint foreign key (sh_id) references shipments_details (sd_id)
)
"""

In [7]:
cursor.execute(membership_table)
cursor.execute(customer_table)
cursor.execute(shipment_details_table)
cursor.execute(status_table)
cursor.execute(payment_table)

0

## Prepare tables content

In [8]:
df_membership = pd.read_csv ('/Users/haddock_ana/Ironhack/Projects/Project 2/Membership.csv')

In [9]:
columnas_minuscula = {i:i.lower() for i in df_membership.columns}
df_membership.rename(columns={"M_ID":"m_id"}, inplace=True)
df_membership.rename(columns=columnas_minuscula, inplace=True)

In [10]:
df_membership['start_date']  = pd.to_datetime(df_membership['start_date'])
df_membership['start_date'] = df_membership['start_date'].apply(lambda x: x.replace(year=2023))

df_membership['end_date']  = pd.to_datetime(df_membership['end_date'])
df_membership['end_date'] = df_membership['end_date'].apply(lambda x: x.replace(year=2023))
df_membership.head()

   m_id start_date   end_date
0    31 2023-11-05 2023-05-16
1   495 2023-09-26 2023-04-11
2   795 2023-10-23 2023-07-13
3    33 2023-06-06 2023-06-01
4   882 2023-06-02 2023-07-26

In [11]:
# Step 1: Identify rows where end_date is smaller than start_date
invalid_rows = df_membership[df_membership['end_date'] < df_membership['start_date']]

# Step 2: Define a function to update the end_date
def update_end_date(date):
    if date.year == 2023:
        date = date.replace(year=2024)
    return date

# Step 3: Apply the function to update end_date in invalid_rows
invalid_rows['end_date'] = invalid_rows['end_date'].apply(update_end_date)

# Step 4: Update the end_date column in the membership DataFrame
df_membership.update(invalid_rows)

In [12]:
df_membership.head()

   m_id start_date   end_date
0    31 2023-11-05 2024-05-16
1   495 2023-09-26 2024-04-11
2   795 2023-10-23 2024-07-13
3    33 2023-06-06 2024-06-01
4   882 2023-06-02 2023-07-26

In [13]:
id_counts = df_membership['m_id'].value_counts()

# Filter for IDs with more than one occurrence (indicating duplicates)
duplicated_ids = id_counts[id_counts > 1]

# If there are duplicated IDs, print them
if not duplicated_ids.empty:
    print("Duplicated member IDs:")
    print(duplicated_ids)
else:
    print("No duplicated member IDs found.")

No duplicated member IDs found.

In [14]:
df_customers = pd.read_csv ('/Users/haddock_ana/Ironhack/Projects/Project 2/Customer.csv')

In [15]:
df_customers.rename(columns={
    "C_ID": "cus_id",
    "M_ID": "membership_id",
    "C_NAME": "name",
    "C_EMAIL_ID": "email",
    "C_TYPE": "cus_type",
    "C_ADDR": "address",
    "C_CONT_NO": "contact"
}, inplace=True)

In [16]:
df_customers.head()

,cus_id,membership_id,name,email,cus_type,address,contact
0,230,31,Mitchell,Harriette42@ymail.com,Internal Goods,2100 Block of 27TH AV,9961255787
1,3189,495,Reginald,Matthew951@yahoo.co.in,Wholesale,300 Block of ELLIS ST,3555176867
2,2216,795,Jaylene,Geraldine867@ymail.co.in,Retail,1000 Block of MISSION ST,9835395970
3,1904,33,Stacie,Brenda905@ymail.com,Internal Goods,800 Block of BRYANT ST,3881250181
4,7342,882,Jonathan,Malie282@gmail.com,Wholesale,0 Block of DRUMM ST,1507211823

In [17]:
id_counts = df_customers['cus_id'].value_counts()

# Filter for IDs with more than one occurrence (indicating duplicates)
duplicated_ids = id_counts[id_counts > 1]

# If there are duplicated IDs, print them
if not duplicated_ids.empty:
    print("Duplicated member IDs:")
    print(duplicated_ids)
else:
    print("No duplicated member IDs found.")

No duplicated member IDs found.

In [18]:
df_payment_details = pd.read_csv ('/Users/haddock_ana/Ironhack/Projects/Project 2/Payment_Details.csv', index_col=False )

In [19]:
columnas_minuscula = {i:i.lower() for i in df_payment_details.columns}
df_payment_details.rename(columns=columnas_minuscula, inplace=True)

In [20]:
df_payment_details.rename(columns={
    "c_id": "sh_client_id",
}, inplace=True)

In [21]:
df_payment_details['payment_date']  = pd.to_datetime(df_payment_details['payment_date'])
df_payment_details['payment_date'] = df_payment_details['payment_date'].apply(lambda x: x.replace(year=2023))

In [22]:
df_payment_details.head()

,payment_id,sh_client_id,sh_id,amount,payment_status,payment_mode,payment_date
0,313cd69e-66f3-11ea-9879-7077813058ce,230,690,49302,PAID,CARD PAYMENT,2023-12-18
1,313dc140-66f3-11ea-a952-7077813058ce,3189,933,78698,PAID,CARD PAYMENT,2023-07-10
2,313eab1e-66f3-11ea-81af-7077813058ce,2216,261,69417,NOT PAID,CARD PAYMENT,NaT
3,313f474a-66f3-11ea-a78b-7077813058ce,1904,445,39655,NOT PAID,COD,NaT
4,3140589a-66f3-11ea-a057-7077813058ce,7342,722,87400,NOT PAID,COD,NaT

In [23]:
df_status = pd.read_csv ('/Users/haddock_ana/Ironhack/Projects/Project 2/Status.csv')

In [24]:
columnas_minuscula = {i:i.lower() for i in df_status.columns}
df_status.rename(columns=columnas_minuscula, inplace=True)

In [25]:
df_status.rename(columns={
    "sh_id": "sh_status_id",
    "current_status": "current_st"
}, inplace=True)

In [26]:
df_status['sent_date'] = pd.to_datetime(df_status['sent_date'], format='%m/%d/%Y').dt.strftime('%Y-%m-%d')
df_status['delivery_date'] = pd.to_datetime(df_status['delivery_date'], format='%m/%d/%Y').dt.strftime('%Y-%m-%d')

# Save updated DataFrame to CSV file
#df_status.to_csv('updated_status.csv', index=False)

In [27]:
from datetime import datetime

def replace_year(date):
    try:
        date_obj = datetime.strptime(date, '%Y-%m-%d')  # Convert string to datetime object
        date_obj = date_obj.replace(year=2023)  # Replace the year
        return date_obj.strftime('%Y-%m-%d')  # Convert back to string
    except ValueError:
        # Handle invalid dates here if needed
        return date

df_status['delivery_date'] = df_status['delivery_date'].astype(str).apply(replace_year)
df_status['sent_date'] = df_status['sent_date'].astype(str).apply(replace_year)

In [28]:
invalid_rows2= df_status[df_status['delivery_date'] < df_status['sent_date']]

In [29]:
for index, row in invalid_rows2.iterrows():
    sent_date = pd.to_datetime(row['sent_date'])
    delivery_date = sent_date + pd.Timedelta(days=4)
    df_status.at[index, 'delivery_date'] = delivery_date

In [30]:
# Replace 'nan' values with None
df_status['delivery_date'] = df_status['delivery_date'].replace('nan', None)

In [31]:
df_status.head()

   sh_status_id     current_st   sent_date delivery_date
0           690      DELIVERED  2023-04-28    2023-12-18
1           933      DELIVERED  2023-06-14    2023-07-10
2           261  NOT DELIVERED  2023-08-14          None
3           445  NOT DELIVERED  2023-12-13          None
4           722  NOT DELIVERED  2023-09-21          None

In [32]:
df_shipment_details = pd.read_csv ('/Users/haddock_ana/Ironhack/Projects/Project 2/Shipment_Details.csv')

In [33]:
df_shipment_details.head()

,SH_ID,C_ID,SH_CONTENT,SH_DOMAIN,SER_TYPE,SH_WEIGHT,SH_CHARGES,SR_ADDR,DS_ADDR
0,690,230,Healthcare,Domestic,Regular,553,1210,1800 Block of 26TH ST,1200 Block of JACKSON ST
1,933,3189,Healthcare,International,Express,810,1114,2600 Block of ALEMANY BL,700 Block of HAMPSHIRE ST
2,261,2216,Luggage,Domestic,Express,994,1020,BARTLETT ST / 23RD ST,500 Block of HAIGHT ST
3,445,1904,Home Furnishing,Domestic,Express,598,1351,1300 Block of 7TH AV,300 Block of 9TH ST
4,722,7342,Electronics,International,Express,412,566,0 Block of EUREKA ST,1800 Block of VANNESS AV

In [34]:
df_shipment_details.rename(columns={
    "C_ID": "customer_id",
    "SER_TYPE": "sd_type",
    "SH_DOMAIN": "sd_domain",
    "SH_WEIGHT": "sd_weight",
    "SH_CHARGES": "sd_charges",
    "SR_ADDR": "sd_address",
    "DS_ADDR": "ds_address",
    "SH_ID": "sd_id",
    "SH_CONTENT": "sd_content",
}, inplace=True)

In [35]:
df_shipment_details.head()

,sd_id,customer_id,sd_content,sd_domain,sd_type,sd_weight,sd_charges,sd_address,ds_address
0,690,230,Healthcare,Domestic,Regular,553,1210,1800 Block of 26TH ST,1200 Block of JACKSON ST
1,933,3189,Healthcare,International,Express,810,1114,2600 Block of ALEMANY BL,700 Block of HAMPSHIRE ST
2,261,2216,Luggage,Domestic,Express,994,1020,BARTLETT ST / 23RD ST,500 Block of HAIGHT ST
3,445,1904,Home Furnishing,Domestic,Express,598,1351,1300 Block of 7TH AV,300 Block of 9TH ST
4,722,7342,Electronics,International,Express,412,566,0 Block of EUREKA ST,1800 Block of VANNESS AV

In [36]:
# Convert data to pandas DataFrame
df_membership = pd.DataFrame(df_membership)
df_customers = pd.DataFrame(df_customers)
df_shipment_details = pd.DataFrame(df_shipment_details)
df_status = pd.DataFrame(df_status)
df_payment_details = pd.DataFrame(df_payment_details)

## Insert data into database

In [37]:
connectionData=f"mysql+pymysql://root:{password}@localhost/Agile_Solutions"
engine = alch.create_engine(connectionData)

In [38]:
df_membership.to_sql(name='membership', con=engine, if_exists='append', index=False)
df_customers.to_sql(name='customer', con=engine, if_exists='append', index=False)
df_shipment_details.to_sql(name='shipments_details', con=engine, if_exists='append', index=False)
df_status.to_sql(name='status', con=engine, if_exists='append', index=False)
df_payment_details.to_sql(name='payment', con=engine, if_exists='append', index=False)

200

In [39]:

# Commit changes
conn.commit() # comit para guardar los cambios
# Close connection
conn.close()